//
// Created by demyk on 27.11.2023.
//
#include <iostream>
using namespace std;

int main() {
    double x, y;

    cout << "Введіть координату x: ";
    cin >> x;

    cout << "Введіть координату y: ";
    cin >> y;

    // Перевірка умови входження точки в область
    if ((x >= -1 && x <= 1 && y >= -1 && y <= 1) ||
        (x >= -2 && x <= 2 && y >= -2 && y <= 2 && (y <= -x + 2 && y >= x - 2))) {
        cout << "Точка з координатами (" << x << ", " << y << ") знаходиться в заштрихованій області.\n";
    } else {
        cout << "Точка з координатами (" << x << ", " << y << ") не знаходиться в заштрихованій області.\n";
    }

    return 0;
}
